#include <SFML\Graphics.hpp>
const int HEIGHT_MAP = 40;//размер карты высота
const int WIDTH_MAP = 160;//размер карты ширина 


sf::String TileMap[HEIGHT_MAP] = {
	"0000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000",
	"0000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000",
	"00                  f00111111111111111111111111111111111111111111111111111100                                                     f00                        f00",
	"00                  f00111111111111111111111111111111111111111111111111111100                                                                                f00",
	"00                  f00111111111111111111111111111111111111111111111111111100                                                                                f00",
	"00                  f00111111111111111111111111111111111111111111111111111100                                                                                f00",
	"00ffffffffffffffff  f00111111111111111111111111111111111111111111111111111100fffffff  ffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffff00",
	"000000000000000000  f000000000000000000000000000000000000000000000000000000000000000  f0000000000000000000000000000000000000000000000000000000000000000000000000",
	"000000000000000000  f000000000000000000000000000000000000000000000000000000000000000  f0000000000000000000000000000000000000000000000000000000000000000000000000",
	"011111111111111100                                                                                                                                           f00",
	"011111111111111100                                                                                                                                           f00",
	"011111111111111100   ffffffffffffffffffffffffffffffffffffff   ffffffffffffffffffffffffffffffffffffffffffff  fffffffffffffffffffffffffff                      f00",
	"011111111111111100  f00000000000000000000000000000000000000   f0000000000000000000000000000000000000000000  f00000000000000000000000000                      f00",
	"011111111111111100  f00000000000000000000000000000000000000   f0000000000000000000000000000000000000000000  f00000000000000000000000000                      f00",
	"011111111111111100  f00fffffffffffffffffffffff00ffffffffff0   fffffffffff00                                                         f00                      f00",
	"011111111111111100  f00                      f00          0   f0         00                                                         f00                      f00",
	"011111111111111100  f00                      f00                         00                                                         f00                      f00",
	"011111111111111100  f00                      f00 o   o   g     g   o   g 00                                                         f00                      f00",
	"011111111111111100                           f00                         00fffffffffffffffffffffffffffffff  fffffffffffffffffffffffff00fffffffffffffffffffffff00",
	"011111111111111100                           f00                         000000000000000000000000000000000  f000000000000000000000000000000000000000000000000000",
	"011111111111111100   ff                      f00 o   g   o     g   o   g 000000000000000000000000000000000  f000000000000000000000000000000000000000000000000000",
	"011111111111111100  f00                      f00                         00                                                                                  f00",
	"011111111111111100  f00                      f00                         00                                                                                  f00",
	"011111111111111100  f00                      f00 g   g   g    fo   g   g 00                                                                                  f00",
	"011111111111111100  f00                      f00             f0          00                                                                                  f00",
	"011111111111111100  f00fffffffffffffffffffffff00fffffffffff  f0ffffffffff00                                                                                  f00",
	"000000000000000000  f0000000000000000000000000000000000000f  f0000000000000                                                                                  f00",
	"000000000000000000  f0000000000000000000000000000000000000f  f0000000000000                                                                                  f00",
	"000                                                                     f00                                                                                  f00",
	"000                                                                     f00                                                                                  f00",
	"000             fffffffffffffffffffffffffffffffffffffffffffffff         f00                                                                                  f00",
	"000             f0000000000000000000000000000000000000000000000         f00                                                                                  f00",
	"000             f0000000000000000000000000000000000000000000000         f00                                                                                  f00",
	"000             f0011111111111111111111111111111111111111111100         f00                                                                                  f00",
	"000             f0011111111111111111111111111111111111111111100         f00                                                                                  f00",
	"000             f0011111111111111111111111111111111111111111100         f00                                                                                  f00",
	"000             f0011111111111111111111111111111111111111111100         f00                                                                                  f00",
	"000ffffffffffffff0011111111111111111111111111111111111111111100ffffffffff00fffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffffff00",
	"0000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000",
	"0000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000000", };

void randomMapGenerate() {//рандомно расставляем камни


	int randomElementX = 0;//случайный элемент по горизонтали
	int randomElementY = 0;//случ эл-т по вертикали
	srand(time(0));//рандом	
	int countStone = 1;//количество обьектов

	while (countStone > 0) {
		randomElementX = 1 + rand() % (WIDTH_MAP - 1);//рандомное по иксу от 1 до ширина карты-1, чтобы не получать числа бордюра карты
		randomElementY = 1 + rand() % (HEIGHT_MAP - 1);//по игреку так же
		if (TileMap[randomElementY][randomElementX] == ' ') {//если встретили символ пробел, 
			TileMap[randomElementY][randomElementX] = 's'; //то ставим туда обьект
														   //std::cout << "coordinate of Stone X:" << randomElementX << "\n" << "coordinate of Stone Y:" << randomElementY << "\n\n";
			countStone--;//создали камень=>счетчик камней будет "текущий минус 1"
		}
	}
}